T = int(input())
for _ in range(1, T + 1):
    total = 0
    a, b, c = map(int, input().split())
    total = (a * (a + 1) // 2) * (b * (b + 1) // 2) * (c * (c + 1) // 2)
    answer = total % 998244353
    print(answer)

''' 
수학 기호에 겁먹지 말고 차분히 규칙을 발견하면 해결할 수 있는 문제
<풀이과정>
- a, b, c의 값 크기가 단순 반복 덧셈으로 일일히 더하는 방식은 시간 초과가 예상되므로 규칙을 찾아 시간 간소화 전략 탐색
- 합을 전개하면서 규칙을 찾음 -> 각각의 합의 곱으로 변환됨
- sum(1, 2, ... ,a) * sum(1, 2, ... ,b) * sum(1, 2, ... ,c)
- sum(1, 2, ... , n)은 합 공식을 사용하여 연산만으로 구할 수 있다.
- 1부터 n까지의 합 공식: n(n+1)//2
'''